Repository: Mohamed18995/AfamiaShop_TFE_2023_2024
Catalog: translations/messages+intl-icu.*.xlf
Languages: fr

source: Account
fr: Compte

source: Sign Out
fr: Se déconnecter

source: Log in
fr: Se connecter

source: Register
fr: S'inscrire

source: Home
fr: Accueil

source: Admin
fr: Administrateur

source: Categories
fr: Catégories

source: Shop
fr: Boutique

source: Contact Us
fr: Contactez-nous

source: The last 4 categories
fr: Les 4 dernières catégories

source: Discover all our categories
fr: Découvrez toutes nos catégories

source: New Products
fr: Nouveaux Produits

source: Discover all our products
fr: Découvrez tous nos produits

source: Our Categories
fr: Nos Catégories

source: Discover
fr: Découvrir

source: Welcome to this Category
fr: Bienvenue dans cette catégorie

source: Show
fr: Montrer

source: Filter our products...
fr: Filtrez nos produits...

source: No result found.
fr: Aucun résultat trouvé.

source: Filter
fr: Filtrer

source: Category
fr: Catégorie

source: Gender
fr: Genre

source: Color
fr: Couleur

source: Address
fr: Adresse

source: Email Address
fr: Adresse e-mail

source: Phone
fr: Téléphone

source: A question, a remark, a suggestion? We will be happy to respond to you as soon as possible.
fr: Une question, une remarque, une suggestion ? Nous nous ferons un plaisir de vous répondre dans les plus brefs délais.

source: Name
fr: Nom

source: Subject
fr: Sujet

source: Send Message
fr: Envoyer le message

source: Advanced search...
fr: Recherche Avancée...

source: Search
fr: Rechercher

source: product name , description or keyword
fr: Nom du produit, description ou mot-clé

source: Picture
fr: Image

source: Product
fr: Produit

source: Price
fr: Prix

source: Quantity
fr: Quantité

source: Remove
fr: Retirer

source: Your cart is empty
fr: Votre panier est vide

source: Cart Totals
fr: Totaux du panier

source: Cart Subtotal
fr: Sous-total du panier

source: Continue Shopping
fr: Continuer vos achats

source: Proceed To CheckOut
fr: Passer la commande

source: You are logged in as
fr: Vous êtes connecté en tant que

source: Logout
fr: Se déconnecter

source: Forgot password?
fr: Mot de passe oublié?

source: or
fr: ou

source: Don't Have an Account?
fr: Vous n'avez pas de compte ?

# Sign up&#10; now
source: Sign up now
fr: S'inscrire maintenant

source: Your Email
fr: Votre E-mail

source: Password
fr: Mot de passe

source: Create an Account
fr: Créer un compte

source: Already have an account?
fr: Vous avez déjà un compte?

source: Repeat Password
fr: Confirmer le mot de passe

source: Username
fr: Nom d'utilisateur

source: Firstname
fr: Prénom

source: Lastname
fr: Nom

source: Reset Password
fr: Réinitialiser le mot de passe

source: Reset password
fr: Réinitialiser le mot de passe

source: Enter your email address and we will send you a link to reset your password.
fr: Entrez votre adresse email et nous vous enverrons un lien pour réinitialiser votre mot de passe.

source: Send password reset email
fr: Envoyer un e-mail de réinitialisation du mot de passe

source: Dashboard
fr: Tableau de bord

source: Orders
fr: Commandes

source: My Address
fr: Mon adresse

source: Account details
fr: Détails du compte

source: Hello
fr: Bonjour

source: From your account dashboard. you can easily check and view your
fr: Depuis le tableau de bord de votre compte. vous pouvez facilement vérifier et visualiser vos

source: orders
fr: commandes

source: manage your
fr: modifier vos

source: addresses
fr: adresses

source: and
fr: et

source: change your account details.
fr: modifier les détails de votre compte.

source: Order Id
fr: Numéro de commande

source: Reference
fr: Référence

source: Transporter Name
fr: Nom du transporteur

source: Transporter Price
fr: Prix ​​du transporteur

source: Delivery Address
fr: Adresse de livraison

source: Is Paid
fr: Est payé

source: Sub Total
fr: Sous-total

source: Add New Address
fr: Ajouter une nouvelle adresse

source: address
fr: adresse

source: City
fr: Ville

source: Country
fr: Pays

source: Save
fr: Enregistrer

source: Addresses
fr: Adresses

source: Id
fr: Identifiant

source: Edit
fr: Modifier

source: Delete
fr: Supprimer

source: Cancel
fr: Annuler

source: Update
fr: Enregistrer les modifications

source: Profile of
fr: Profil de

source: User Name
fr: Nom d'utilisateur

source: First Name
fr: Prénom

source: Last Name
fr: Nom de famille

source: Change your profile
fr: Changez votre profil

source: Change your password
fr: Changez votre mot de passe

source: Change of profile of
fr: Changement De Profil De

source: Change
fr: Changer

source: Change confirmed of
fr: Changement Confirmé De

source: Your change is successfully confirmed.
fr: Votre modification est confirmée avec succès.

source: Click here to visit your profile
fr: Cliquez ici pour visiter votre profil

source: Change confirmation
fr: Confirmation du changement

source: Change Password
fr: Changer Le Mot De Passe

source: Your password has been changed
fr: Votre mot de passe a été changé

source: Your old password
fr: Votre ancien mot de passe

source: old password
fr: ancien mot de passe

source: New password
fr: Nouveau mot de passe

source: Confirm new Password
fr: Confirmer le nouveau mot de passe

source: Password Reset Email Sent
fr: E-mail de réinitialisation du mot de passe envoyé

source: If an account matching your email exists, then an email was just sent that contains a link that you can use to reset your password. This link will expire in
fr: S'il existe un compte correspondant à votre adresse e-mail, un e-mail vient d'être envoyé contenant un lien que vous pouvez utiliser pour réinitialiser votre mot de passe. Ce lien expirera dans

source: If you don't receive an email please check your spam folder or
fr: Si vous ne recevez pas d'e-mail, veuillez vérifier votre dossier spam ou

source: try again
fr: réessayer .

source: Sign up now
fr: S'inscrire maintenant

source: To reset your password, please visit the following link
fr: Pour réinitialiser votre mot de passe, veuillez visiter le lien suivant

source: This link will expire in
fr: Ce lien expirera dans

source: Cheers!
fr: Acclamations!

source: Reset your password
fr: Réinitialisation de votre mot de passe

source: Hi!
fr: Bonjour!

source: Registration email sent
fr: Email d'inscription envoyé

source: Registration Email Sent
fr: Email d'inscription envoyé

source: If there is an account matching your email address, an email has just been sent containing a link you can use to confirm your registration .
fr: S'il existe un compte correspondant à votre adresse email, un email vient d'être envoyé contenant un lien que vous pouvez utiliser pour confirmer votre inscription.

source: Hi! Please confirm your email!
fr: Bonjour! Veuillez confirmer votre email!

source: Please confirm your email address by clicking the following link:
fr: Veuillez confirmer votre adresse e-mail en cliquant sur le lien suivant :

source: Confirm my Email
fr: Confirmer mon email

source: Registration confirmation
fr: Confirmation d'inscription

source: Registration confirmed
fr: Inscription confirmée

source: Your registration is successfully confirmed .
fr: Votre inscription est confirmée avec succès.

source: Click here to log in to your account
fr: Cliquez ici pour vous connecter à votre compte

source: Please Confirm your Email
fr: Veuillez confirmer votre email

# &quot;Afamia Contact&quot;
source: \"Afamia Contact\"
fr: " Contact Afamia "

source: Your password reset request
fr: Votre demande de réinitialisation de mot de passe

source: Afamia Contact
fr: " Contact Afamia "

source: Login
fr: Se connecter

source: List of Newsletters
fr: Liste des newsletters

source: ID
fr: Identifiant

source: Registered
fr: Inscrits

source: Send
fr: Envoyer

source: Subscribe to our nexsletters
fr: Abonnez-vous à nos nexsletters

source: Choose your newsletters
fr: Choisissez Vos Newsletters

source: I accept the collection of my personal data
fr: J'accepte la collecte de mes données personnelles

source: New products
fr: Nouveaux produits

source: Your subscription to the newsletter
fr: Votre inscription à la newsletter

source: Newsletter subscription email sent
fr: Email d'inscription à la newsletter envoyé

source: Newsletter subscription
fr: Inscription à la Newsletter

source: If there is an account matching your email address, an email has just been sent containing a link you can use to confirm your newsletter subscription .
fr: S'il existe un compte correspondant à votre adresse email, un email vient d'être envoyé contenant un lien que vous pouvez utiliser pour confirmer votre inscription à la newsletter.

source: newsletter registration
fr: inscription à la newsletter

source: Your registration
fr: Votre inscription

source: You are subscribed to the newsletter
fr: Vous êtes inscrit à la newsletter

source: click on this link to confirm your subscription to the newsletters
fr: cliquez sur ce lien pour confirmer votre inscription aux newsletters

source: newsletter subscription confirmation
fr: Confirmation d'inscription à la newsletter

source: newsletter subscription confirmed
fr: Inscription à la newsletter confirmée

source: Your newsletter subscription is successfully confirmed.
fr: Votre inscription à la newsletter est confirmée avec succès.

source: Click here to visit our Afamia Shop website
fr: Cliquez ici pour visiter notre site Afamia Shop

source: categories
fr: Catégories

source: Detail of a category
fr: Détail d'une catégorie

source: New Contact
fr: Nouveau Contact

source: Cart
fr: Panier

source: Your Account
fr: Votre Compte

source: Change Profile
fr: Changement de Profil

source: Show Product
fr: Description du produit

source: Add to cart
fr: Ajouter au panier

source: Category :
fr: Catégorie :

source: Color :
fr: Couleur :

source: More Informations
fr: Plus d'informations

source: List of comments
fr: Liste des commentaires

source: Add a comment
fr: Ajouter un commentaire

source: Comment
fr: Commentaire

source: by
fr: par

source: Published the
fr: Publié le

source: ----------No comments----------
fr: ----------Aucun commentaire----------

source: Your email
fr: Votre e-mail

source: Your name
fr: Votre nom

source: Your comment
fr: Votre commentaire

source: Description of product :
fr: Description du produit :

source: Checkout Confirmation
fr: Confirmation de paiement

source: Transporter
fr: Transporteur

source: Your Order
fr: Votre commande

source: SubTotal
fr: Sous Total

source: Shipping
fr: Expédition

source: Pay now
fr: Payer maintenant

source: Checkout
fr: Vérifier

source: Add new address
fr: Ajouter une nouvelle adresse

source: Validate my order
fr: Valider ma commande

source: Payment success
fr: Succès du paiement

source: Your order number
fr: Votre commande numéro

source: is completed!
fr: est terminé !

source: Thank you for your order! Your order number
fr: Nous vous remercions de votre commande! Votre numéro de commande

source: is being processed and will be completed within 3-6 hours. You will receive an email confirmation when your order is completed.
fr: est en cours de traitement et sera complété dans un délai de 3 à 6 heures. Vous recevrez un e-mail de confirmation lorsque votre commande sera terminée.

source: Charms
fr: Charmes

source: Necklaces
fr: Colliers

source: Earrings
fr: Boucles d'oreilles

source: Medals
fr: Médailles

source: White Silver Single Ear Ring
fr: Boucle D'oreille en argent blanc

source: White Silver Earrings
fr: Boucles d'oreilles en argent blanc

source: Yellow Gold Earrings
fr: Boucles d'oreilles en or jaune

source: Silver Multi Tassel Bracelet
fr: Bracelet argenté multiples

source: Disney Gold Steel Bracelet
fr: Bracelet en acier doré Disney

source: White Steel Cuff Bracelet
fr: Bracelet manchette en acier blanc

source: Yellow Gold Plated Bracelet
fr: Bracelet Plaqué Or Jaune

source: Double White Steel Bracelet
fr: Bracelet Double Acier Blanc

source: White Steel And Gold Bracelet
fr: Bracelet En Acier Blanc Et Or

source: Gold Plated Fancy Mesh Bracelet
fr: Bracelet Maille Fantaisie Or

source: Yellow Gold Charm
fr: Charme en or jaune

source: Amethyst Yellow Gold Necklace
fr: Collier Améthyste Or Jaune

source: White Steel Plate Necklace
fr: Collier en plaque d'acier blanc

source: No results for your search.
fr: Aucun résultat pour votre recherche.

source: White Silver Single Ear Ring Double Domed Rows Diameter 10mm-1
fr: Boucle d'oreille simple en argent blanc, rangées doubles bombées, diamètre 10mm

source: The best looking accessory anytime and anywhere for men and women
fr: Le meilleur accessoire à tout moment et en tout lieu pour hommes et femmes

source: Address And Contact
fr: Adresse et contact

source: You Have A Question ?
fr: Une question ?

source: Find your answer by clicking on the button below , filling out the form and sending it to us
fr: Trouvez votre réponse en cliquant sur le bouton ci-dessous, en remplissant le formulaire et en nous l'envoyant

source: Subscribe Our Newsletters
fr: Abonnez-vous à nos newsletters

source: Subscribe to our newsletters by clicking on the button below
fr: Abonnez-vous à nos newsletters en cliquant sur le bouton ci-dessous

source: Subscribe
fr: Abonnez-vous

source: You haven't placed an order yet!
fr: Vous n'avez pas encore passé de commande !

source: We couldn't find an address for you, please create one!
fr: Nous n'avons pas trouvé d'adresse pour vous, veuillez en créer une !

source: Your Orders
fr: Vos commandes

source: Your Addresses
fr: Vos adresses

source: Edit your profile
fr: Modifier votre profil

source: Edit your password
fr: Modifier votre mots de passe

source: Add a new address
fr: Ajouter une nouvelle adresse

source: Edit Address
fr: Modifier une adresse

source: Edit your address
fr: Modifier votre adresse

source: Retour page compte
fr: Retourner vers votre compte

source: New Address
fr: Nouvelle adresse

source: Your address has been registered successfully
fr: Votre adresse a bien été enregistrée

source: Your address has been changed
fr: Votre adresse a bien été modifiée

source: Your address has been deleted
fr: Votre adresse a bien été supprimée

source: User
fr: Utilisateur

source: Your Address n°
fr: Votre adresse n°

source: Your profile has been changed
fr: Votre profil a bien été modifiée

source: Order Details
fr: Détails de la commande

source: Order number
fr: Commande numéro

source: Retour page orders
fr: Retourner à la liste des commandes

source: Your comment has been sent
fr: Votre commentaire a été envoyé

source: The form contains errors . please correct and try again .
fr: Le formulaire contient des erreurs. veuillez corriger et réessayer.

source: Log out
fr: Déconnexion

source: My Account
fr: Mon Compte

source: See
fr: Voir

source: Return to address list
fr: Retour à la liste d'adresses

source: The last four categories added
fr: Les quatre dernières catégories ajoutées

source: terms and conditions
fr: Conditions générales

source: Article 1 - Identity of the seller
fr: Article 1 - Identité de AfamiaShop

source: AfamiaShop België trades under the name: AfamiaShop.be
fr: AfamiaShop Belgique exerce ses activités sous le nom : AfamiaShop.be

source: Registered address :
fr: Adresse d'établissement :

source: _ Belgium
fr: _Belgique

source: Availibility :
fr: Accessibilité :

source: _ Monday to Friday from 8:00 until 19:59
fr: _ Du lundi au vendredi de 8:00 à 19:59

source: _ Telephone number 0489 47 08 53
fr: _Numéro de téléphone : 0489 47 08 53

source: _ Email address: ay1665ay@gmail.com
fr: _Adresse mail : ay1665ay@gmail.com

source: _ Company number: BE 0000 222 444
fr: _ Numéro d'entreprise: BE 0000 222 444

source: _ Bank account number: BE00000000000000
fr: Numéro de compte bancaire : BE00000000000000

source: Article 2 - Applicability
fr: Article 2 - Champ d'application

source: Article 3 - Our assortment and your order
fr: Article 3 - Notre offre et votre commande

source: Article 4 - The price
fr: Article 4 - Le prix

source: Article 5 - Payment
fr: Article 5 - Paiement

source: Article 6 - Conformity and warranty
fr: Article 6 - Conformité et garantie

source: Article 7 - Delivery and implementation
fr: Article 7 - Livraison et exécution

source: Article 9 - Intellectual property
fr: Article 9 - Propriété intellectuelle

source: Article 10 - Complaints procedure and disputes
fr: Article 10 - Règlement en matière de réclamations et litiges

source: Our Terms and Conditions apply to all offers by us as Online Retailer, to you as Consumer (any natural person who, for non-professional purposes only, acquires or uses products or services on the market)
fr: Les présentes conditions générales s'appliquent à chaque offre/proposition entre AfamiaShop en tant que webshop et vous en tant que Consommateur (toute personne physique qui acquiert ou utilise, à des fins excluant tout professionnel, des produits ou des services mis sur le marché)

source: We only deliver in Belgium. If you select a shipping address in a different country, we can refuse your order
fr: Nous ne livrons qu'en Belgique. Si votre adresse de livraison se situe dans un autre pays, nous nous réservons le droit de refuser votre commande.

source: You need to be at least 18 years of age to place an order. If you're not 18 yet, we'd like to ask you to have your parents or a legal guardian place the order. If we notice that an order has been placed by a minor, we can refuse this order
fr: Pour placer une commande, vous devez être âgé d'au moins 18 ans. Si vous n'avez pas encore 18 ans, nous demandons que vos parents ou un tuteur légal placent la commande. Si nous remarquons qu'une commande a été placée par un mineur, nous sommes en droit de refuser cette commande

source: Placing an order on the website counts as explicit acceptance of our Terms and Conditions, which can be accessed at all times through our website
fr: En plaçant une commande sur notre site, vous acceptez explicitement nos conditions générales qui sont disponibles sur notre site web à tout moment

source: If you order online, we will attach a copy of these Terms and Conditions in a format that can be saved or printed to your order confirmation or, at the latest, to your delivery. We urge you to always save or print the Terms and Conditions
fr: Si vous commandez en ligne, une copie de ces conditions générales vous sera fournie lors de la confirmation de votre commande ou au plus tard lors de la livraison, sous un format que vous pouvez enregistrer ou imprimer, ce que nous vous recommandons de faire dans tous les cas

source: In the event that, in addition to these general Terms and Conditions, specific product or service conditions also apply, the above also applies to those special conditions. In the event of conflicting conditions, the consumer can always invoke the applicable condition that is most favorable to them
fr: Dans l'hypothèse où, outre les présentes conditions générales, des conditions spécifiques aux produits ou aux services sont d'application, ce qui précède s'applique également à ces conditions particulières. En cas de dispositions contradictoires entre les conditions, le consommateur peut toujours invoquer l'application de la disposition lui étant la plus favorable

source: If an offer has a limited validity period, or is made under conditions, this will be explicitly stated in the offer
fr: Lorsqu'une offre a une durée de validité limitée ou est soumise à conditions, ceci est toujours mentionné expressément dans l'offre

source: We'll describe what we sell and how the order process will proceed as fully and accurately as possible. The description will be sufficiently detailed to enable a good evaluation of the offer by the consumer. If we use images, these will be a true representation of the offered products, digital content, and/or services. Oversights happen, and if we've clearly made a mistake, we're not required to deliver afterwards
fr: Notre offre contient toujours une description complète et précise des produits proposés et de la méthode de commande. La description est suffisamment détaillée pour vous permettre d'évaluer adéquatement le contenu de l'offre. Si AfamiaShop a recours à des images/photos, celles-ci sont une représentation fidèle des produits et/ou services proposés. Cependant, l'erreur est humaine et dans le cas où nous nous sommes manifestement trompés, nous ne nous trouvons pas dans l'obligation de quand même vous livrer les produits demandés

source: If you order from us, you'll receive a confirmation by email. Your order will be complete and the agreement between us will be definitive as soon as we've received approval from the card company for your transaction with debit or credit cards. We accept Bancontact, Paypal, Visa, MasterCard, money transfers, and cash. If the card company does not approve of your payment to us, we cannot be held responsible for delays in shipping and/or non-delivery of your order. Orders without a valid payment in the name of the registered cardholder will not be accepted or processed
fr: Votre commande est complète et l'accord entre nous définitif dès que nous avons confirmé votre commande par mail et dès que nous avons reçu la validation de votre transaction financière avec une carte de crédit ou de débit par l'organisme émetteur de cette carte. Nous acceptons les paiements par Visa, MasterCard, et les paiements en espèces ainsi que par carte de paiement dans un des magasins AfamiaShop. Dans le cas où l'organisme émetteur de votre carte refuse votre paiement à destination de AfamiaShop, nous ne pouvons pas être tenus responsables des retards et/ou de la non-livraison de votre commande. Les commandes sans paiement valide au nom du titulaire enregistré de la carte ne seront pas acceptées ou traitées

source: To purchase a product, you add the product to your shopping cart. Afterwards, you provide your contact information and invoice information. Next, you choose your delivery method: delivery on your chosen address, send to a chosen pickup point, or pickup in one of our AfamiaShop store. During the last step, you'll see an overview page where you can accept our Terms and Conditions and where you can confirm the payment by clicking the order button ¿I'm going to order¿. Once you've completed these steps, your purchase is final
fr: Pour acheter un produit, ajoutez-le à votre panier. Ensuite, remplissez le formulaire avec vos données personnelles ainsi que vos données de facturation et choisissez votre mode de livraison : livraison à l'adresse choisie, retrait au point de retrait de votre choix ou retrait dans un de nos magasins AfamiaShop. Dans la dernière étape du procédé de commande, vous verrez une page de résumé où il vous sera demandé d'accepter nos Conditions Générales et de confirmer votre paiement par l'activation du bouton « Je commande ». Si vous avez parcouru toutes ces étapes, votre achat est définitif

source: During the period we mention in our offer, our prices do not change, with the exception of price changes due to changes in VAT rates
fr: Pendant la durée de validité mentionnée dans l'offre, les prix des produits et/ou services proposés ne seront pas augmentés, sauf les modifications de prix résultant d'une évolution des taux de TVA

source: Our prices include all taxes, VAT, taxes and services. You will never face surprises here. Shipping is free. If you choose time slot delivery we will charge shipping costs. In that case, we always let you know before you place your order
fr: Nos prix incluent l'ensemble des taxes, impôts et services. Il n'y aura donc jamais de surprise pour vous. La livraison est gratuite. Cependant, si vous choisissez l'option de livraison LivréAujourd'hui® ou la livraison sur rendez-vous dans le créneau horaire de votre choix, les frais d'envoi seront à votre charge. Dans ce cas, nous vous en notifierons avant la confirmation de votre commande
