Repository: Mohamed18995/AfamiaShop_TFE_2023_2024
Catalog: translations/messages+intl-icu.*.xlf
Languages: fr

source: white
fr: Blanc

source: silver
fr: Argent

source: silver white
fr: Argent blanc

source: black
fr: Noir

source: yellow
fr: Jaune

source: white black
fr: Blanc Noir

source: category.
fr: categorie.

source: gender.
fr: genre.

source: color.
fr: couleur.

source: categories.
fr: catégories.

source: New categories
fr: Nouvelles catégories

source: Event announcements
fr: Annonces d'événements
