Repository: Mohamed18995/AfamiaShop_TFE_2023_2024
Catalog: translations/messages+intl-icu.*.xlf
Languages: fr

source: If you order from us, you'll receive a confirmation by email. Your order will be complete and the agreement between us will be definitive as soon as we've received approval from the card company for your transaction with debit or credit cards. We accept Visa, MasterCard and cash. If the card company does not approve of your payment to us, we cannot be held responsible for delays in shipping and/or non-delivery of your order. Orders without a valid payment in the name of the registered cardholder will not be accepted or processed
fr: Votre commande est complète et l'accord entre nous définitif dès que nous avons confirmé votre commande par mail et dès que nous avons reçu la validation de votre transaction financière avec une carte de crédit ou de débit par l'organisme émetteur de cette carte. Nous acceptons les paiements par Visa, MasterCard et les paiements en espèces ainsi que par carte de paiement dans un des magasins AfamiaShop. Dans le cas où l'organisme émetteur de votre carte refuse votre paiement à destination de AfamiaShop, nous ne pouvons pas être tenus responsables des retards et/ou de la non-livraison de votre commande. Les commandes sans paiement valide au nom du titulaire enregistré de la carte ne seront pas acceptées ou traitées

source: We can only accept payment via the payment modules on our website for online orders
fr: Pour les commandes placées en ligne, le paiement est limité aux modes de paiement proposés sur notre site internet

source: In order to guarantee secure online payments and the security of your personal data, the transaction data is transmitted via the internet, encrypted with SSL technology. To pay with SSL, you do not need special software. You can recognize a secure SSL connection by the "lock" in your browser's status bar
fr: Afin de garantir un paiement en ligne sécurisé ainsi que la confidentialité de vos données à caractère personnel, les données de transaction seront cryptées avec une technologie SSL et envoyées sur internet. Vous n'avez pas besoin de logiciel spécial pour faire des transactions avec SSL. Vous reconnaitrez une connexion sécurisée SSL au petit cadenas dans la barre de recherche de votre navigateur

source: We guarantee that our goods are in accordance with your order and meet the normal expectations that you may have, taking into account the specifications of the product. We also guarantee that our goods comply with all laws existing at the time of your order.
fr: Nous garantissons que nos produits sont conformes à votre commande et répondent aux attentes normales que vous pouvez avoir tenant compte des spécifications du produit. Évidemment, nous garantissons également que nos biens répondent à l'ensemble des lois existantes au moment de votre commande.

source: In addition, with regard to the delivery of goods, we also apply the statutory minimum warranty period of two years if the good is not in conformity with the order placed. This means that, in case of defects or defects to the good, this good will be repaired free of charge or replaced for up to 2 years after delivery.
fr: En outre, concernant la livraison de biens, vous jouissez du délai de garantie légale minimum de deux ans en cas de non-conformité du bien de consommation. Ceci signifie qu'en cas de défaut ou de vice du bien, vous avez le droit à la réparation ou au remplacement sans frais du bien, et ce jusque 2 ans après la livraison.

source: Sometimes AfamiaShop or its supplier offers a longer or more extensive warranty than the legal minimum warranty of 2 years; this is a commercial warranty. The commercial warranty does not affect the statutory minimum warranty. Whether a commercial warranty is offered differs per product. The characteristics of the commercial warranty are stated on the product web page and the proof of warranty. AfamiaShop is responsible for handling the commercial warranty, unless stated otherwise on the product's web page. Commercial warranties apply in Belgium and for the period stated on the product's web page.
fr: Il arrive que AfamiaShop ou ses fournisseurs proposent une garantie plus longue ou plus étendue que la garantie légale minimum : c'est la garantie commerciale. La garantie commerciale ne réduit pas la garantie minimum légale. Dans le cas d'une garantie commerciale, celle-ci varie en fonction du produit. Les caractéristiques de la garantie commerciale sont mentionnées sur la page internet du produit ainsi que sur la preuve de garantie. AfamiaShop se tient responsable du traitement de la garantie commerciale, sauf indication contraire sur la page internet du produit. Les garanties commerciales sont valables en Belgique et durant le délai indiqué sur la page internet du produit.

source: All goods and services are delivered on the address you supplied in your order
fr: Les livraisons de produits et services prennent place à l'adresse de livraison communiquée lors de votre commande

source: We will take the greatest possible care when receiving and implementing product orders, and when assessing applications for the provision of services
fr: Nous ferons preuve de la plus grande diligence possible lors de la réception des commandes de produits et lors de l'exécution de celles-ci et à l'occasion de l'appréciation des demandes de fourniture de services

source: We will execute accepted orders expeditiously but no later than 30 days, unless another delivery period has been agreed upon. If the delivery is delayed, or if an order cannot or only partially be executed, we will always inform you before the expiration of the planned delivery period. If we do not, you can cancel your order, free of charge. In that case, we will refund you within 30 days after termination
fr: Nous exécutons les commandes acceptées dans les meilleurs délais et, en toutes circonstances, dans les 30 jours, à moins qu'un autre délai de livraison n'ait été convenu. Dans le cas où la livraison subit un retard ou lorsqu'une commande ne peut être exécutée, même partiellement, nous vous en informons toujours avant la fin du délai de livraison prévu. Si nous ne vous informons pas à temps, vous avez le droit d'annuler votre commande sans frais. Dans ce cas, nous vous rembourserons dans les 30 jours suivant l'annulation

source: Our shipments are always at our risk until the time of delivery to you or a representative appointed by you. You do not have to worry about goods that are lost in the mail. However, if you return us goods within 30 days of purchase because you would rather not keep them, you are responsible for transportation.
fr: Jusqu'au moment de réception de la commande par vous ou un représentant désigné préalablement, les envois ont toujours lieu à notre risque. Vous ne devrez jamais vous soucier d'éventuelles pertes de marchandises dans la poste. Cependant, l'envoi de retour de marchandises que vous nous retournez dans les 30 jours suivant l'achat parce que vous ne souhaitez pas les conserver, a toujours lieu à votre propre risque.

source: If the goods delivered by us during the transport were damaged, do not correspond with the items stated on the delivery note, or do not correspond to the items you ordered, you must report this as soon as possible and return the items to us
fr: Si les marchandises livrées par nos soins ont été endommagées pendant le transport, ne correspondent pas aux articles figurant sur le bon de livraison ou ne correspondent pas aux articles que vous avez commandés, vous devez le signaler le plus tôt possible et nous renvoyer les articles en question

source: We can not be held responsible for any consequential damages due to late delivery or non-delivery by the carrier that the company has appointed. Our liability in such cases is limited to the value of the items that are shown not to have been received by the customer
fr: Nous ne pouvons être tenus responsables de tout dommage indirect à la suite d'une livraison tardive ou d'une non-livraison par le transporteur désigné par l'entreprise. Dans ces cas-là, notre responsabilité se limite à la valeur des biens dont il peut être démontré qu'ils n'ont pas été reçus par le client

source: In the event of force majeure, we are not required to carry out our obligations. In the case of force majeure, we can either postpone our obligations for the duration of the force majeure, or terminate the agreement permanently.
fr: En cas de force majeure, nous ne sommes pas tenus de respecter nos obligations. Dans ce cas, nous nous réservons le droit de suspendre nos obligations pour la durée de la force majeure ou d'annuler définitivement votre commande.

source: Force majeure includes any situation outside of our will and control which prevents us from fulfilling our promises to you. This includes strikes, fire, malfunctions, power failures, network failures in, for instance, telecommunication networks, connections, or used systems of communication, or the unavailability of our website at any time, non-timely delivery by suppliers or other third parties
fr: On entend par force majeure toute circonstance indépendante de notre volonté et de notre contrôle qui empêche entièrement ou partiellement le respect de nos obligations à votre égard. Ces circonstances sont entre autres : les grèves, les incendies, le chômage technique, les pannes de courant, les perturbations dans un réseau (de télécommunication) ou dans la connexion ou les systèmes de communication utilisés et/ou la non disponibilité de notre site internet à un moment donné, l'absence de livraison ou la livraison tardive par nos sous-traitants ou d'autres tiers concernés

source: Our website, logos, texts, photos, names, and all our communication in general are protected by intellectual property rights known to us, or to our suppliers or other beneficiaries.
fr: Notre site web, nos logos, textes, photos, noms et en général toute notre communication, sont protégés par des droits d'auteur appartenant soit à nous, soit à nos sous-traitants ou d'autres ayants droits.

source: It is prohibited to use and/or make changes to the intellectual property rights as described in this article. For example, you may not copy or reproduce drawings, photographs, texts, logos, color combinations, etc ... without our prior written consent.
fr: Il est interdit de faire usage de et/ou d'apporter des modifications aux droits de propriété intellectuelle tels que décrits dans cet article. Par exemple, les dessins, photos, noms, textes, logos, combinaison de couleurs etc. ne peuvent en aucune manière être copiés ou reproduits sans autorisation expresse préalable et écrite de AfamiaShop.

source: We hope that our customers are 100% satisfied. If you do have a complaint, please let us know as soon as possible via ay1665ay@gmail.com, phone number 0489 47 08 53, or via a letter addressed to: AfamiaShop Belgium , Rue des Rivageois 7 , 4000 Liège . We'll do everything we can to help you within 5 working days.
fr: Bien évidemment, nous espérons toujours que tous nos clients soient satisfaits à 100 %. Au cas où vous auriez néanmoins des plaintes sur la qualité de nos services, vous pouvez nous contacter via ay1665ay@AfamiaShop.be, par téléphone au 0489 47 08 53, ou par lettre adressée à : AfamiaShop Belgique , Rue des Rivageois 7 , 4000 Liège . Nous ferons tout notre possible pour traiter votre plainte dans les 5 jours ouvrables.

source: All agreements that we conclude with our clients, regardless of their place of residence, are governed exclusively by Belgian law, and in case of a dispute, only the competent Belgian courts are competent. If, for reasons of international law, another law applies, Book VI of the Belgian Economic Law Code will be referenced when interpreting the current Terms and Conditions.
fr: Le droit belge est exclusivement d'application sur tous les contrats avec nos clients, quel que soit leur lieu de résidence. Tous les litiges sont soumis à la compétence exclusive des cours et tribunaux belges. Si, pour des motifs de droit international, il s'avérait malgré tout qu'un autre droit s'applique, il faudra dans un premier temps, à l'occasion de l'interprétation des conditions générales actuelles, se référer au Livre VI du Code de droit économique belge.

source: The Consumer Mediation Service of the FOD Economie is qualified to process any request to settle extrajudicial consumer disputes. They will, in turn, process the request themselves or send it to a qualified entity. You can reach the Consumer Mediation Service via this link: https://www.consumentenombudsdienst.be/en
fr: En cas de règlement extrajudiciaire d'un litige, le Service de Médiation pour le Consommateur mis en place par le Gouvernement fédéral est compétent pour recevoir toute demande de règlement extrajudiciaire de litiges avec des consommateurs. Celui-ci décidera alors de traiter lui-même la requête ou de la transmettre à une entité qualifiée. Vous pouvez contacter le Service de Médiation pour le Consommateur via le lien suivant : https://www.mediationconsommateur.be/fr

source: If there is a cross-border dispute, the consumer can rely on the Online Dispute Resolution platform of the European Union via this link: https://ec.europa.eu/odr.
fr: En cas de litige ayant un caractère transfrontalier, le consommateur peut, en outre, recourir à la plateforme « Online Dispute Resolution » de l'Union européenne par le biais du lien suivant : https://ec.europa.eu/odr.

source: My Accounts
fr: Mon Compte

source: Monday - Friday : 8:00 - 20:00
fr: Lundi - Vendredi : 8:00 - 20:00

source: Thank you for your order!
fr: Nous vous remercions de votre commande!

source: To the site AfamiaShop
fr: Vers le site AfamiaShop

source: name, description or keyword
fr: nom, description ou mot-clé

source: A question, a remark, a suggestion? We will be happy to respond to you as soon as possible.
fr: Une question, une remarque, une suggestion ? Nous nous ferons un plaisir de vous répondre dans les plus brefs délais.

source: First name
fr: Prénom

source: Last name
fr: Nom

source: Advanced search ...
fr: Recherche Avancée ...

source: Your message has been sent, An advisor will answer uoy very quickly
fr: Votre message a été envoyé, un conseiller vous répondra très rapidement

source: Product categories
fr: Nos Catégories

source: On this page you will find all the products related to
fr: Sur cette page vous trouverez tous les produits liés à

source: For best results click on the shop page. You will also find all AfamiaShop products. Browse the overview and find the right product or filter the products you are looking for.
fr: Pour de meilleurs résultats, cliquez sur la page de la boutique. Vous trouverez également tous les produits AfamiaShop. Parcourez l'aperçu et trouvez le bon produit ou filtrez les produits que vous recherchez.

source: For best results click on the shop page. You will also find all AfamiaShop products. Browse the overview and find the right product or filter the products you are looking for.
fr: Pour de meilleurs résultats, cliquez sur la page de la boutique. Vous trouverez également tous les produits AfamiaShop. Parcourez l'aperçu et trouvez le bon produit ou filtrez les produits que vous recherchez.

source: New Categories
fr: Nouvelles catégories

source: Secure Payment
fr: Paiement Sécurisé

source: Come and discover our new products
fr: Venez découvrir nos nouveaux produits

source: It's time to discover our new categories
fr: C'est le moment de découvrir nos nouvelles catégories

source: Enjoy your purchase with secure payment
fr: Profitez de votre achat avec paiement sécurisé

source: , the
fr: , le

source: products found
fr: Produits trouvés

source: Fast delivery
fr: Livraison rapide

source: newsletter Unsubscription Confirmed
fr: Confirmation de désinscription à la newsletter

source: You are unsubscribed from the newsletters.
fr: Vous êtes désabonné des newsletters.

source: To subscribe for a level, please click on this link
fr: Pour vous réinscrire, veuillez cliquer sur ce lien

source: Novelty alert
fr: Alerte nouveauté

source: Dear subscribers, The wait is over!
fr: Chers abonnés,l'attente est terminée !

source: Our newsletters
fr: Nos newsletters

source: Be among the first to get your hands on our latest finds! Our new products are here, ready to enhance your daily life. Be quick, Don't wait to add them to your cart before it's too late! . We are waiting for you on our website
fr: Soyez parmi les premiers à mettre la main sur nos dernières trouvailles ! Nos nouveaux produits sont là, prêts à embellir votre quotidien. Faites-vite, Ne tardez pas à les ajouter à votre panier avant qu'il ne soit trop tard ! . Nous vous attendons sur notre site

source: Confirm
fr: Confirmer

source: Unsubscribe
fr: Se désabonner

source: Any question ? Click here to contact us
fr: Des questions ? Cliquez ici pour nous contacter

source: To unsubscribe, click on this link
fr: Pour vous désinscrire, cliquez sur ce lien

source: The team of
fr: L'équipe de

source: I Shop
fr: J'achete

source: New things are upon us! In three days, you will be able to explore new horizons on our site. Be ready to discover the best we have concocted for you!
fr: La nouveauté est à nos portes ! Dans trois jours, vous pourrez explorer de nouveaux horizons sur notre site. Soyez prêts à découvrir ce que nous avons concocté de mieux pour vous !

source: Broaden your horizons! We are pleased to announce the arrival of new categories on our site, to better meet all your needs and desires. Take the first step towards discovery by exploring our site now!
fr: Élargir vos horizons! Nous sommes heureux de vous annoncer l'arrivée de nouvelles catégories sur notre site, pour mieux répondre à tous vos besoins et envies. Faites le premier pas vers la découverte en explorant notre site dès maintenant !

source: Event Announcements
fr: Annonces d'événements

source: You haven't created a newsletter yet!
fr: Vous n'avez pas encore créé de newsletter !

source: Yellow
fr: Jaune

source: White
fr: Blanc

source: White Silver
fr: Argent Blanc

source: White Black
fr: Blanc Noir

source: Black
fr: Noir

source: Silver
fr: Argent

source: Gender :
fr: Genre :

source: Man
fr: Homme

source: Women
fr: Femme

source: Double Row White Steel Bracelet Black Agate Beads 21.5cm-2
fr: Bracelet Double Rang Acier Blanc Perles Agate Noire 21.5cm-2

source: Please select one of these options.
fr: Veuillez sélectionner l'une de ces options.

source: Please enter a password
fr: Veuillez entrer un mot de passe

source: Your password should be at least
fr: Votre mot de passe doit comporter au moins

source: Temporarily out of stock
fr: Temporairement en rupture de stock

source: SubTotal Htva
fr: SousTotal Htva

source: Cart Subtotal Htva
fr: Sous-total du panier Htva

source: Your AfamiaShop Cart is empty
fr: Votre panier AfamiaShop est vide

source: Press the button and discover our products
fr: Appuyez sur le bouton et découvrez nos produits

source: Discover our products
fr: Découvrez nos produits

source: Fancy Yellow Gold Earrings
fr: Boucles d'Oreilles Or Jaune

source: Head Tassel Steel Bracelet
fr: Bracelet en acier à pompon tête

source: White Steel yellow Bracelet
fr: Bracelet Jaune Acier Blanc

source: Yellow Gold Feather Charm
fr: Charm plume en or jaune

source: Topaz Yellow Half Hoop Earrings
fr: Boucles d'oreilles d-créoles jaune

source: Silver White Earrings Hexagonal
fr: Boucles d'Oreilles Argent Blanc

source: Engraved Pastille Silver Bracelet
fr: Bracelet Argent Pastille Gravée

source: Yellow Emerald Solitaire Bracelet
fr: Bracelet Solitaire Émeraude Jaune

source: Jourdan Men's Bracelet Steel
fr: Bracelet Homme Jourdan Acier

source: White Round Medal Thinking
fr: Pensée Médaille Ronde Blanche

source: Yellow Medal Virgin Pattern
fr: Motif Vierge Médaille Jaune

source: Silver White Medal Pendant
fr: Pendentif Médaille Blanc Argent

source: White Silver Necklace
fr: Collier en argent blanc

source: Yellow Solitaire Necklace
fr: Collier Solitaire Jaune

source: Yellow Necklace Oxides Shape
fr: Collier Jaune Forme Oxydes

source: White And Oxide Necklace
fr: Collier Blanc Et Oxyde

source: Black Fancy Mesh Necklace
fr: Collier Maille Fantaisie Noir

source: Yellow Charm Letter E
fr: Lettre de charme jaune E

source: Silver White Heart Earrings
fr: Boucles d'oreilles coeur blanc argenté

source: Yellow Gold Stud Earrings
fr: Boucles d'oreilles clous en or jaune

source: Yellow Plated Bracelet Oval
fr: Bracelet Plaqué Jaune Ovale

source: Plated Articulated Mesh Bracelet
fr: Bracelet en maille articulée plaquée

source: Yellow Clothilde Amethyst Necklace
fr: Collier d'améthyste Clothilde jaune

source: White Chiseled Plate Necklace
fr: Collier plaque ciselée blanche

source: Silver white Drop Earrings
fr: Boucles d'oreilles pendantes blanc argenté

source: Black Earrings Infinite Shapes
fr: Boucles D'oreilles Noires Formes Infinies

source: Yellow Oxide Bar Earrings
fr: Boucles d'oreilles barre en oxyde jaune

source: Yellow Oriental Pearl Earrings
fr: Boucles d'oreilles perles orientales jaunes

source: Silver White Dangling Earrings
fr: Boucles d'oreilles blanches argentées

source: Silver White Hoop Earrings
fr: Boucles d'oreilles blanches argentées

source: Silver White Cross Bracelet
fr: Bracelet Croix Blanche Argent

source: Silver White Openwork Bracelet
fr: Bracelet Argent Blanc Ajouré

source: Faceted Black Ceramic Bracelet
fr: Bracelet Céramique Noire Facetté

source: Eleastic bracelet Black Faceted
fr: Bracelet élastique Noir Facetté

source: White Bracelet Openwork Waves
fr: Bracelet Blanc Vagues Ajourées

source: White Entourage Bracelet
fr: Bracelet Entourage Blanc

source: Yellow Hollow Circle bracelet
fr: Bracelet Cercle Creux Jaune

source: Yellow Bracelet Flexible Bangle
fr: Bracelet Flexible Jaune B

source: White Steel ball Bracelet
fr: Bracelet boule en acier blanc

source: Elastic White Steel Bracelet
fr: Bracelet élastique en acier blanc

source: Double Yellow Plated Bracelet
fr: Bracelet Double Plaqué Jaune

source: Black Steel Bracelet
fr: Bracelet Double en acier noir

source: White Tree Charm
fr: Charme d'arbre blanc

source: White Engravable Heart Charm
fr: Charm coeur blanc à graver

source: Yellow Dream Catcher Charm
fr: Charme Attrape-rêves Jaune

source: Yellow Cubic Key Charm
fr: Charm clé cubique jaune

source: Yellow Letter L Charm
fr: Charm Lettre L Jaune

source: Engravable Yellow Pastille Charm
fr: Charm Pastille Jaune Gravable

source: Yellow Oval Enamel Medal
fr: Médaille ovale jaune en émail

source: Yellow Openwork Dove Medal
fr: Médaille Colombe Jaune Ajourée

source: White Silver Pendant Medal
fr: Médaille Pendentif Argent Blanc

source: Black Steel Necklace Stones
fr: Collier Acier Noir Pierres

source: Silver White Ball Necklace
fr: Collier boule blanche argentée

source: White Necklace Forçat Blue
fr: Collier Blanc Forçat Bleu

source: White Solitaire Mesh Necklace
fr: Collier en maille solitaire blanc

source: Yellow Plated Diamond Necklace
fr: Collier Diamant Plaqué Jaune

source: Yellow Pearl Necklace 2strands
fr: Collier de perles jaunes 2 brins

source: Convict Yellow Diam Necklace
fr: Collier Diam Jaune Forçat

source: White Silver Navy Anchor Necklace
fr: Collier d'ancre marine en argent blanc

source: Yellow Engraved Plaque Necklace
fr: Collier plaque gravée jaune

source: Yellow Christ Child Medal
fr: Médaille Enfant Christ Jaune

source: Yellow Round Medal Pendant
fr: Pendentif Médaille Ronde Jaune

source: Saint Christopher Yellow Medal
fr: Médaille Jaune Saint Christophe

source: Silver White Heart Earrings for women
fr: Boucles d'oreilles coeur blanc argenté pour femme

source: Silver White
fr: Argent Blanc

source: Silver White Heart Earrings for women of 2 pieces right and left of very good quality
fr: Boucles d'oreilles coeur blanc argenté pour femme de 2 pièces droite et gauche de très bonne qualité
